#### Terraform Plan 📖`success`
#### `Plan: 22 to add, 1 to change, 0 to destroy.`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Stromweld/tf_repo_manager/runs/run-r4Y7y9NMisUVreMx

Waiting for the plan to start...

Terraform v1.2.0
on linux_amd64
Initializing plugins and modules...
module.tf_repos.module.looper["tf_repo_manager"].module.repository.github_repository.this: Refreshing state... [id=tf_repo_manager]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_repository.this: Refreshing state... [id=chef_base_config]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository.this: Refreshing state... [id=chef_timezone_iii]
module.other_repos.module.looper["chef-repo"].module.repository.github_repository.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_repository.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_repository.this: Refreshing state... [id=aws_temp_saml_creds]
module.other_repos.module.looper["github-workflows"].module.repository.github_repository.this: Refreshing state... [id=github-workflows]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_autopatch_ii]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_repository.this: Refreshing state... [id=chef_chef_software]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_repository.this: Refreshing state... [id=chef_base_role]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_repository.this: Refreshing state... [id=terraform-tfe-workspaces]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_artifactory_ii]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_repository.this: Refreshing state... [id=chef_collectd_ii]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_repository.this: Refreshing state... [id=terraform-github-repositories]
module.other_repos.module.looper["kickstart"].module.repository.github_repository.this: Refreshing state... [id=kickstart]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_repository.this: Refreshing state... [id=terraform-tfe-private-modules]
module.tf_repos.module.looper["tf_repo_manager"].module.repository.data.github_branch.main: Reading...
tfe_oauth_client.github: Refreshing state... [id=oc-My3Z8GgnzemkfQKc]
module.tf_repos.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace.workspace: Refreshing state... [id=ws-sKUnXifAZaTLrKVo]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_repository_collaborator.this["limitusus"]: Refreshing state... [id=chef_timezone_iii:limitusus]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.data.github_branch.main: Reading...
module.tf_repos.module.looper["tf_repo_manager"].module.repository.data.github_branch.main: Read complete after 1s [id=tf_repo_manager:main]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_artifactory_ii:main]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_chef_software:main]
module.other_repos.module.looper["chef-repo"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_collectd_ii:main]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_base_role:main]
module.other_repos.module.looper["kickstart"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_timezone_iii:main]
module.other_repos.module.looper["github-workflows"].module.repository.data.github_branch.main: Reading...
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_autopatch_ii:main]
module.tf_repos.module.looper["tf_repo_manager"].module.repository.github_branch_default.this: Refreshing state... [id=tf_repo_manager]
module.tf_repos.module.looper["tf_repo_manager"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHSeHTM4Bh7gF]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.data.github_branch.main: Read complete after 1s [id=chef_base_config:main]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHXVheM4BioLf]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.data.github_branch.main: Read complete after 1s [id=aws_temp_saml_creds:main]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_autopatch_ii]
module.other_repos.module.looper["chef-repo"].module.repository.data.github_branch.main: Read complete after 1s [id=chef-repo:main]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_branch_default.this: Refreshing state... [id=chef_base_config]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.data.github_branch.main: Read complete after 1s [id=Chef_AD_DNS_Solarwinds_Spacewalk:main]
module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_branch_default.this: Refreshing state... [id=chef_base_role]
module.other_repos.module.looper["kickstart"].module.repository.data.github_branch.main: Read complete after 1s [id=kickstart:main]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_default.this: Refreshing state... [id=chef_chef_software]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_collectd_ii]
module.other_repos.module.looper["github-workflows"].module.repository.data.github_branch.main: Read complete after 0s [id=github-workflows:main]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_timezone_iii]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_default.this: Refreshing state... [id=chef_artifactory_ii]
module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE1]
module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY0NzAy]
module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHXVhc84BioLg]
module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCbOQcM4Bh7gD]
module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzY2MDE3]
module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlNzU5Mzgw]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_default.this: Refreshing state... [id=aws_temp_saml_creds]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOBP18Nc4Bh7f_]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_default.this: Refreshing state... [id=chef-repo]
module.other_repos.module.looper["github-workflows"].module.repository.github_branch_default.this: Refreshing state... [id=github-workflows]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_default.this: Refreshing state... [id=kickstart]
module.other_repos.module.looper["Chef_AD_DNS_Solarwinds_Spacewalk"].module.repository.github_branch_default.this: Refreshing state... [id=Chef_AD_DNS_Solarwinds_Spacewalk]
module.other_repos.module.looper["chef-repo"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCbdKjM4Bh7f-]
module.other_repos.module.looper["aws_temp_saml_creds"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOFQgqW84Bh7gA]
module.other_repos.module.looper["github-workflows"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwbc4BiWy2]
module.other_repos.module.looper["kickstart"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOCW9ReM4Bh7gC]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.data.github_branch.main: Reading...
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-mHz65UZ77CqY4nFa]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-bjcjq8rHd2mYxoSq]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.tf_module[0].tfe_registry_module.tf_module: Refreshing state... [id=mod-cePnVEzzY2MwYRNw]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.data.github_branch.main: Read complete after 6s [id=terraform-tfe-workspaces:main]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.data.github_branch.main: Read complete after 6s [id=terraform-github-repositories:main]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.data.github_branch.main: Read complete after 5s [id=terraform-tfe-private-modules:main]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-github-repositories]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-tfe-private-modules]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_default.this: Refreshing state... [id=terraform-tfe-workspaces]
module.tf_modules_repos.module.looper["terraform-tfe-workspaces"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwQ84BiWy1]
module.tf_modules_repos.module.looper["terraform-github-repositories"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwT84BiWy3]
module.tf_modules_repos.module.looper["terraform-tfe-private-modules"].module.repository.github_branch_protection.default["main"]: Refreshing state... [id=BPR_kwDOHWIwe84BiWy6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_artifactory_ii"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_actions_secret.this["SUPERMARKET_URL"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_artifactory_ii"
      + secret_name     = "SUPERMARKET_URL"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_artifactory_ii"].module.repository.github_actions_secret.this["SUPERMARKET_USER"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_artifactory_ii"
      + secret_name     = "SUPERMARKET_USER"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_autopatch_ii"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_actions_secret.this["SUPERMARKET_URL"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_autopatch_ii"
      + secret_name     = "SUPERMARKET_URL"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_autopatch_ii"].module.repository.github_actions_secret.this["SUPERMARKET_USER"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_autopatch_ii"
      + secret_name     = "SUPERMARKET_USER"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_base_config"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_actions_secret.this["SUPERMARKET_URL"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_base_config"
      + secret_name     = "SUPERMARKET_URL"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_base_config"].module.repository.github_actions_secret.this["SUPERMARKET_USER"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_base_config"
      + secret_name     = "SUPERMARKET_USER"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_base_role"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_actions_secret.this["SUPERMARKET_URL"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_base_role"
      + secret_name     = "SUPERMARKET_URL"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_base_role"].module.repository.github_actions_secret.this["SUPERMARKET_USER"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_base_role"
      + secret_name     = "SUPERMARKET_USER"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_chef_software"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_actions_secret.this["SUPERMARKET_URL"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_chef_software"
      + secret_name     = "SUPERMARKET_URL"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_chef_software"].module.repository.github_actions_secret.this["SUPERMARKET_USER"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_chef_software"
      + secret_name     = "SUPERMARKET_USER"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_collectd_ii"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_actions_secret.this["SUPERMARKET_URL"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_collectd_ii"
      + secret_name     = "SUPERMARKET_URL"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_collectd_ii"].module.repository.github_actions_secret.this["SUPERMARKET_USER"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_collectd_ii"
      + secret_name     = "SUPERMARKET_USER"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_actions_secret.this["SUPERMARKET_KEY"] will be created
  + resource "github_actions_secret" "this" {
      + created_at  = (known after apply)
      + id          = (known after apply)
      + repository  = "chef_timezone_iii"
      + secret_name = "SUPERMARKET_KEY"
      + updated_at  = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_actions_secret.this["SUPERMARKET_URL"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_timezone_iii"
      + secret_name     = "SUPERMARKET_URL"
      + updated_at      = (known after apply)
    }

  # module.chef_cb_repos.module.looper["chef_timezone_iii"].module.repository.github_actions_secret.this["SUPERMARKET_USER"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "chef_timezone_iii"
      + secret_name     = "SUPERMARKET_USER"
      + updated_at      = (known after apply)
    }

  # module.tf_repos.module.looper["tf_repo_manager"].module.repository.github_actions_secret.this["TOKEN_TFC"] will be created
  + resource "github_actions_secret" "this" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "tf_repo_manager"
      + secret_name     = "TOKEN_TFC"
      + updated_at      = (known after apply)
    }

  # module.tf_repos.module.looper["tf_repo_manager"].module.tf_workspace["default"].tfe_workspace.workspace will be updated in-place
  ~ resource "tfe_workspace" "workspace" {
        id                            = "ws-sKUnXifAZaTLrKVo"
        name                          = "tf_repo_manager"
      ~ terraform_version             = "1.2.0" -> "1.2.1"
        # (14 unchanged attributes hidden)
    }

Plan: 22 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @Stromweld, Action: `pull_request`*